/* **************************************************************************
 * Copyright (C) 2008 BJoRFUAN. All Right Reserved
 * **************************************************************************
 * This module, contains source code, binary and documentation, is in the
 * BSD License, and comes with NO WARRANTY.
 *
 *                                                 torao <torao@bjorfuan.com>
 *                                                       http://www.moyo.biz/
 * $Id:$
*/
package org.koiroha.jyro.util;




// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ParseException:
// ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
/**
 *
 * <p>
 * @version $Revision:$
 * @author torao
 * @since 2011/07/17 Java SE 6
 */
public class ParseException extends Exception {

	// ======================================================================
	// Serial Version
	// ======================================================================
	/**
	 * Serial version UID of this class.
	 */
	private static final long serialVersionUID = 1L;

	// ======================================================================
	// コンストラクタ
	// ======================================================================
	/**
	 * コンストラクタは何も行いません。
	 * <p>
	 */
	public ParseException() {
		// TODO 自動生成されたコンストラクター・スタブ
		return;
	}

	// ======================================================================
	// コンストラクタ
	// ======================================================================
	/**
	 * コンストラクタは何も行いません。
	 * <p>
	 * @param arg0
	 */
	public ParseException(String arg0) {
		super(arg0);
		// TODO 自動生成されたコンストラクター・スタブ
		return;
	}

	// ======================================================================
	// コンストラクタ
	// ======================================================================
	/**
	 * コンストラクタは何も行いません。
	 * <p>
	 * @param arg0
	 */
	public ParseException(Throwable arg0) {
		super(arg0);
		// TODO 自動生成されたコンストラクター・スタブ
		return;
	}

	// ======================================================================
	// コンストラクタ
	// ======================================================================
	/**
	 * コンストラクタは何も行いません。
	 * <p>
	 * @param arg0
	 * @param arg1
	 */
	public ParseException(String arg0, Throwable arg1) {
		super(arg0, arg1);
		// TODO 自動生成されたコンストラクター・スタブ
		return;
	}

}
